#+TITLE: March 12, 2017 - March 28, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                            | CANCELED |
|------+------+-------------+---------+-----------------------------------------------------------------+----------|
|      |      |             |         | READING.1489241516. Linux Device Drivers, 3rd edit (2017-03-28) |          |
|      |      |             |         | KERNEL.1489241583. Try shakthimaan Linux device d (2017-03-13)  |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME   | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|--------+-----------+--------+------+-----------+--------------+------------|
| Mbuf   |         0 |      0 |    0 |         0 |   2017-03-29 | ---------- |
| Mpduty |      16.0 |   6.25 | 16.0 |         0 |   2017-03-29 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  16 ++--#---+-------+--------+-------+-------+-------+--------+-------+--++   
:     |   .#..                                                              |   
:  14 ++    # ....                                           ACTUAL #######++   
:     |      #    ....                                        IDEAL ....... |   
:  12 ++      ###########################################################  ++   
:     |                   .                                             #   |   
:     |                    ....                                          #  |   
:  10 ++                       ....                                      # ++   
:     |                            ....                                  #  |   
:   8 ++                               ........                          # ++   
:     |                                        ....                       # |   
:   6 ++                                           ....                   #++   
:     |                                                .....              # |   
:   4 ++                                                    ...            #+   
:     |                                                        .           #|   
:     |                                                         ....       #|   
:   2 ++                                                            ....   #+   
:     |                                                                 ....*   
:   0 ++------+-------+--------+-------+-------+-------+--------+-------+--+*   
:     0       2       4        6       8       10      12       14      16      
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED    |
|-----+------------+--------+-------+--------------------|
|   1 | 2017-03-12 |   16.0 |    15 |                    |
|   2 | 2017-03-13 |   12.0 |    14 | KERNEL.1489241583  |
|   3 | 2017-03-14 |   12.0 |    13 |                    |
|   4 | 2017-03-15 |   12.0 |    12 |                    |
|   5 | 2017-03-16 |   12.0 |    11 |                    |
|   6 | 2017-03-17 |   12.0 |    10 |                    |
|   7 | 2017-03-18 |   12.0 |     9 |                    |
|   8 | 2017-03-19 |   12.0 |     8 |                    |
|   9 | 2017-03-20 |   12.0 |     8 |                    |
|  10 | 2017-03-21 |   12.0 |     7 |                    |
|  11 | 2017-03-22 |   12.0 |     6 |                    |
|  12 | 2017-03-23 |   12.0 |     5 |                    |
|  13 | 2017-03-24 |   12.0 |     4 |                    |
|  14 | 2017-03-25 |   12.0 |     3 |                    |
|  15 | 2017-03-26 |   12.0 |     2 |                    |
|  16 | 2017-03-27 |   12.0 |     1 |                    |
|  17 | 2017-03-28 |    0.0 |     0 | READING.1489241516 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                                 | TASKID             | OWNER  | PRIORITY | TODO | ESTIMATED | ACTUAL |
|----------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| * TASKS                                                              |                    |        | B        |      |      16.0 |   6.25 |
|----------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| ** READING                                                           |                    |        | B        |      |      12.0 |        |
| *** Linux Device Drivers, 3rd edition, Part II                       | READING.1489241516 | mpduty | B        | DONE |      12.0 |        |
|----------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| ** KERNEL                                                            |                    |        | B        |      |       4.0 |   6.25 |
| *** Try shakthimaan Linux device driver code examples, Part II [7/7] | KERNEL.1489241583  | mpduty | B        | DONE |       4.0 |   6.25 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2017-03-12 Sun>
  :wpd-mpduty:      2
  :wpd-mbuf:      1
  :END:
** READING
*** DONE Linux Device Drivers, 3rd edition, Part II
    CLOSED: [2017-03-28 Tue 11:46]
    :PROPERTIES:
    :ESTIMATED: 12.0
    :ACTUAL:
    :OWNER: mpduty
    :ID: READING.1489241516
    :TASKID: READING.1489241516
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-27 Mon 06:10]--[2017-03-27 Mon 08:15] =>  2:05
    CLOCK: [2017-03-26 Sun 08:15]--[2017-03-26 Sun 10:20] =>  2:05
    CLOCK: [2017-03-24 Fri 07:50]--[2017-03-24 Fri 10:00] =>  2:10
    CLOCK: [2017-03-23 Thu 08:10]--[2017-03-23 Thu 10:25] =>  2:15
    CLOCK: [2017-03-21 Tue 08:20]--[2017-03-21 Tue 10:10] =>  1:50
    CLOCK: [2017-03-20 Mon 20:10]--[2017-03-20 Mon 23:35] =>  3:25
    CLOCK: [2017-03-19 Sun 07:05]--[2017-03-19 Sun 08:15] =>  1:10
    CLOCK: [2017-03-18 Sat 20:45]--[2017-03-18 Sat 22:30] =>  1:45
    CLOCK: [2017-03-17 Fri 08:15]--[2017-03-17 Fri 10:35] =>  2:20
    CLOCK: [2017-03-15 Wed 20:55]--[2017-03-15 Wed 22:10] =>  1:15
    :END:
    - [X] Chapter 6: Advanced Char Driver Operations
    - [X] Chapter 7: Time, Delays, and Deferred Work
    - [X] Chapter 8: Allocating Memory
    - [X] Chapter 9: Communicating with Hardware
    - [X] Chapter 10: Interrupt Handling 	
** KERNEL
*** DONE Try shakthimaan Linux device driver code examples, Part II [7/7]
    CLOSED: [2017-03-13 Mon 22:54]
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL: 6.25
    :OWNER: mpduty
    :ID: KERNEL.1489241583
    :TASKID: KERNEL.1489241583
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-12 Sun 10:15]--[2017-03-12 Sun 16:30] =>  6:15
    :END:
    - [X] Example 7
    - [X] Example 8
    - [X] Example 9
    - [X] Example 10
    - [X] Example 11
    - [X] Example 12
    - [X] Example 13
